jekyll/blog/_posts/2014-04-30-webinar.html
---
layout: post
title: VIVO Apps and Tools Webinar
tags:
 - vivo
 - lattes
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Yerterday I presented for the Apps and Tools working group my workflow
to prepared data to be inserted into FGV VIVO instance. Since some
people asked be to share the links and the file that I used to guide
my presentation, I made this post. 
</p>

<p>
This page is generated from a <a href="http://orgmode.org">org file</a> that I export to HTML and
further processed with <a href="http://jekyllrb.com">Jekyll</a>. The process of use org files with
jekyll is outlined <a href="http://orgmode.org/worg/org-tutorials/org-jekyll.html">here</a>. I am stil not very confortable with this
workflow but I am using it for my personal website and for the
websites of the courses that I teach at FGV.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> My Toolset</h2>
<div class="outline-text-2" id="text-2">
<p>
This is the non comprehensive list of tools that I use. I am listing
here the main tools that come up into my mind that should be
interesting to others.
</p>

<ul class="org-ul">
<li><a href="http://www.gnu.org/software/emacs/">Emacs</a>
</li>
<li><a href="http://orgmode.org">Org-Mode</a>
</li>
<li><a href="http://common-lisp.net/project/slime/">Slime</a>
</li>
<li>Common Lisp compilers and interpreters: <a href="http://franz.com/products/allegro-common-lisp/">Allegro CL</a>, <a href="http://www.sbcl.org">SBCL</a> and <a href="http://abcl.org">ABCL</a>
  (Lisp on JVM, so I can use Java RDF libraries).
</li>
<li><a href="http://www.w3.org/2000/10/swap/doc/cwm.html">CWM</a>
</li>
<li><a href="http://franz.com/agraph/allegrograph/">Allegro Graph Triplestore</a>
</li>
<li><a href="http://franz.com/agraph/gruff/">Gruff</a>
</li>
<li>Git
</li>
<li><a href="http://www.r-project.org">R</a>
</li>
<li>Python
</li>
<li><a href="http://xmlsoft.org">xsltproc and xmllint</a>
</li>
<li><a href="http://tidy.sourceforge.net">tidy</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Datasources</h2>
<div class="outline-text-2" id="text-3">
<p>
We have to main sources of data: (1) the FGV researchers' curricula
vitae from <a href="http://lattes.cnpq.br">Lattes Platform</a> and; (2) the FGV digital library.
</p>

<p>
During the webinar I shared my screen and presented the web interface
that <a href="http://cnpq.br">CNPq</a> provides for researchers update their resumes. I also shown
<a href="http://lattes.cnpq.br/0675365413696898">my curriculum vitae</a> and discussed why I do not consider Brazilian
Researchers curricula vitae open data given the captcha that blocks
crawlers to get XML files from the Lattes website in a batch mode.
</p>

<p>
I forgot to mention during the webinar but one of my old dreams is to
convice CNPq to add <a href="http://www.w3.org/TR/xhtml-rdfa-primer/">RDFa</a> or <a href="https://schema.org">https://schema.org</a> microformats into the
HTML pages of the curricula vitae. This would not only allow crawlers
to easier process the data but could also facilitate the maintainance
of the system. My current XSLT transformation of Lattes XML to RDF
cloud provide the starting point to RDFa embeeding.
</p>

<p>
The <a href="http://bibliotecadigital.fgv.br/dspace">FGV Digital Library</a> runs Dspace. The publications and collections
metadata are easly collected from Dspace using the <a href="http://www.openarchives.org/">OAI-PMH protocol</a>.
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Lattes XML Files</h2>
<div class="outline-text-2" id="text-4">
<p>
As I said in the previous section, the curricula vitae of Brazilian
Researchers are not open data, that is, they are not public available
in structured format. They are only public available as HTML pages in
the Lattes website, with limited search interface. The only way to
universities and research institutions get the curricula vitae of
their researchers in a structured format is to sign an <a href="http://www.cnpq.br/web/portal-lattes/acordos-institucionais">aggrement</a> with
CNPq. FGV has signed this aggrement and we have one server authorized
to access CNPq web server to retrive the XML files of all curriculae
that have informed any professional activity with FGV.
</p>

<p>
To transform the Lattes files to RDF, I use a XSLT transformation that
I developed few years ago. The XSLT is freely available at github in
the repository <a href="https://github.com/arademaker/SLattes">Semantic Lattes</a>. 
</p>

<p>
In this repo, I made also available the DTD that I try hard to keep
up-to-date. Unfortunately, until recently, CNPq did not make public
annoucement of chances in the structure of the XML files that they
produce, so I had to adapt the DTD whenever I identify changes. I have
just found in the end of <a href="http://www.cnpq.br/web/portal-lattes/extracoes-de-dados">this page</a> that CNPq finally realized the
importance of making available the updated DTD. Nevertheless, the DTD
in the link of this page is outdated. At least, using this DTD to
validate the 489 FGV's curriculae I got more than 100 erros but using
my DTD to validate the same files I got only 2 errors. Considering
that those 489 files were produced my CNPq, we have two options: (1)
the DTD is outdated; or (2) the code that produces the XML files has
bugs. The two erros that I find using my DTD occur only with two
curriculae that were not updated in the last 2 years.
</p>

<p>
After download the XML files, the general idea to process them and
produce the RDF files is outlined in the code below:
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #a020f0;">for</span> f<span style="color: #a020f0;"> in</span> $<span style="color: #a0522d;">ROOT</span>/ontos/xml/*.xml; <span style="color: #a020f0;">do</span>
    <span style="color: #a0522d;">ID</span>=$(<span style="color: #ff00ff;">basename</span> $<span style="color: #a0522d;">f</span> .xml)
    <span style="color: #483d8b;">echo</span> Processing $<span style="color: #a0522d;">ID</span>
    xmllint --noout --dtdvalid $<span style="color: #a0522d;">REPO</span>/LMPLCurriculo.DTD $<span style="color: #a0522d;">f</span> 2&gt;&gt; error.log
    xsltproc --stringparam ID $<span style="color: #a0522d;">ID</span> $<span style="color: #a0522d;">REPO</span>/lattes.xsl $<span style="color: #a0522d;">f</span> &gt; $<span style="color: #a0522d;">ID</span>.rdf  
<span style="color: #a020f0;">done</span>
</pre>
</div>

<p>
After that, I import the RDF files to Allegro Graph making each
curriculum a separated graph so I can easly identify the provenance of
each triple. The importation is done using the <a href="http://franz.com/agraph/support/documentation/current/agload.html">agload</a> utility. The
load process takes aprox. 2 minutes:
</p>

<pre class="example">
Load finished 487 sources in 00:02:03 (123.02 seconds).  
Triples added: 1,690,538 
Average Rate: 13742.00 tps
</pre>
</div>
</div>
