org/blog/_posts/2014-04-30-webinar.org
* Deduplication of instances

I briefly commented about the deduplication of records during the
webinar. I do have to take care of removing duplicated resources about
the same entity. Considering a thesis defended by and student at FGV
whom have as advisor a professor at FGV. I will have metadata
(triples) about this thesis from three different sources: (1) the RDF
produced from the advisor's curriculum lattes XML; (2) the RDF produce
from the student's curriculum lattes XML; and (3) the RDF obtained
from the FGV Digital Library. 

The [[http://github.com/arademaker/vivo-code][current code]] that I use to identify duplicated resources is a
Common Lisp library that is easily used if placed inside the
local-projects directory of a [[http://www.quicklisp.org/][Quicklisp]] instalation.

I can write an entire article only about deduplication in RDF. I am
still thinking hard about this problem and really would like to find
better alternatives.  One can note that deduplication of nodes in a
RDF graph should not be done type by type as I am doing now. The rules
to identify resources as being refering the same entity could
dependent each other. That is, the deduplication of instances of
=foaf:Person= can activate the rule to deduplicate instances of
=bibo:Article= and vice-versa. It would be better to have a kind of
fixed point transformation in the RDF graph that could keep clustering
nodes until nothing more can be done. As a logician, I am very
interested in approach this problem in a more declarative and
deductive way.

I also have to note that =owl:sameAs= semantics doesn't help here. I
do use =owl:sameAs= to mark the nodes that should be merged but I have
to merge the nodes after all =owl:sameAs= triples are produced. I do
this with two SPARQL construct queries:

#+BEGIN_EXAMPLE
delete { ?s1 ?p ?o . }
insert { ?s2 ?p ?o . }
where {
  ?s1 owl:sameAs ?s2 .
  ?s1 ?p ?o .
  filter( !sameTerm(?p, owl:sameAs) )
}
#+END_EXAMPLE

#+BEGIN_EXAMPLE
delete { ?x ?p ?o1 . }
insert { ?x ?p ?o2 . }
where {
  ?o1 owl:sameAs ?o2 .
  ?x ?p ?o1 .
  filter( !sameTerm(?p, owl:sameAs) )
}
#+END_EXAMPLE

Note that the filters block the propagation of the =owl:sameAs=
triples. Anyway, my current code is available for suggestions.

* Mapping Lattes RDF to VIVO RDF

To map the Lattes RDF model produced by my XSLT to the expected VIVO
RDF model, I have to look carefully to each instance of data. This
mapping is not completed but at this point I have already mapped most
of the data about people, publication, research areas and
departaments.

To work on the rules and queries to transform the data, I used to
excellent query and data browsers tools developed by Franz: Gruff and
AllegroGraph WebView. During the webinar I presented both systems.

- CWM and file rules.n3 (performance issues, used for prototype)
- CL + SPARQL (show saved queries in Allegro Graph WebView)
 - Problems:
   - blank nodes
   - can't repeate a query without duplicate triples
- Next steps: 
 - validation (OWL Reasoner?)
 - Better rule approach (like cwm) but with better performance?

* Working with OAI-PMH

- http://www.openarchives.org
- http://re.cs.uct.ac.za
- http://cran.r-project.org/web/packages/OAIHarvester/index.html
- https://pypi.python.org/pypi/pyoai/2.4.4

** Repository Exploring

#+BEGIN_SRC R :results table :cache yes
library(OAIHarvester)
baseurl <- "http://bibliotecadigital.fgv.br/oai/request"
oaih_list_metadata_formats(baseurl)
#+END_SRC

#+RESULTS[dd4722f705f05eb68c2467507e4b544b27d4a687]:
| oai_dc | http://www.openarchives.org/OAI/2.0/oai_dc.xsd              | http://www.openarchives.org/OAI/2.0/oai_dc/ |
| rdf    | http://www.openarchives.org/OAI/2.0/rdf.xsd                 | http://www.openarchives.org/OAI/2.0/rdf/    |
| ore    | http://tweety.lanl.gov/public/schemas/2008-06/atom-tron.sch | http://www.w3.org/2005/Atom                 |
| mets   | http://www.loc.gov/standards/mets/mets.xsd                  | http://www.loc.gov/METS/                    |

#+name: sets
#+BEGIN_SRC R :cache yes
sets <- oaih_list_sets(baseurl)
head(sets)
#+END_SRC

#+RESULTS[88f5fc9bb6b8b770ab93863c18bf4730121309ad]: sets
| hdl_10438_6904 | Cadernos FGV Projetos                                                            | list() |
| hdl_10438_4132 | CPDOC - Artigos, Livros, Papers                                                  | list() |
| hdl_10438_2692 | CPDOC - Dissertações, Mestrado em História, Política e Bens Culturais            | list() |
| hdl_10438_1758 | CPDOC - Dissertações, Mestrado Profissional em Bens Culturais e Projetos Sociais | list() |
| hdl_10438_4164 | CPDOC Relações Internacionais - Artigos e papers                                 | list() |
| hdl_10438_4168 | CPDOC Relações Internacionais -Teses e Dissertações                              | list() |

#+BEGIN_SRC R :var series=sets :results output
records <- oaih_list_records(baseurl, set = series[3,1])
dim(records)
colnames(records)
#+END_SRC

#+RESULTS[3587dddb293079161648e2c7e98cd2fa565669ab]:
: [1] 31  5
: [1] "identifier" "datestamp"  "setSpec"    "metadata"   "about"

#+BEGIN_SRC R :results output
records[1,"metadata"]
#+END_SRC

#+RESULTS[7bb006f3d1b1a99e16a30bc162146090c066c046]:
#+begin_example
$metadata
<oai_dc:dc schemaLocation="http://www.openarchives.org/OAI/2.0/oai_dc/ http://www.openarchives.org/OAI/2.0/oai_dc.xsd" xmlns:oai_dc="http://www.openarchives.org/OAI/2.0/oai_dc/" xmlns:dc="http://purl.org/dc/elements/1.1/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <dc:title>Por que é cidadão o jornalista-cidadão? História das mídias e jornalismo cidadão de base comunitária na Maré</dc:title>
 <dc:creator>Chagas, Viktor Henrique Carneiro de Souza</dc:creator>
 <dc:description>Afinal, por que é cidadão o jornalista cidadão? Foi esta a pergunta que desencadeou
todo um esforço de pesquisa no sentido de identificar práticas comuns nas diferentes
experiências de jornalismo cidadão. Para desenvolver e tentar ampliar o conceito
trabalhado, a opção foi de analisar o espectro da comunicação comunitária, sobretudo
em veículos que tiveram origem na área da Maré, no Rio de Janeiro, nas últimas três
décadas. Assim, mapeando algumas dessas experiências e selecionando casos entre os
que chamaram mais atenção pela propriedade com que trabalham os aspectos
relacionados ao jornalismo cidadão, esta dissertação se detém sobre o significado da
cidadania para o cidadão-jornalista e a contribuição à identidade local prestada pela
comunicação comunitária. Minha idéia é demonstrar como experiências deste gênero
são capazes de não apenas de pautar meios tradicionais de mídia, mas sobretudo de
ajudar a estabelecer dentro da própria comunidade uma cultura de mídia e uma esfera
pública local, desenvolvendo uma reapropriação da identidade da favela e de seus
moradores e contribuindo para a busca e/ou exercício da cidadania.</dc:description>
 <dc:contributor>Hollanda, Bernardo Borges Buarque de</dc:contributor>
 <dc:contributor>Albuquerque, Afonso de</dc:contributor>
 <dc:contributor>Aldé, Alessandra</dc:contributor>
 <dc:contributor>Miguel, Luis Felipe</dc:contributor>
 <dc:contributor>Lattman-Weltman, Fernando</dc:contributor>
 <dc:date>2009-06-17T19:02:36Z</dc:date>
 <dc:date>2009-06-17T19:02:36Z</dc:date>
 <dc:date>2009-03-06</dc:date>
 <dc:type>Dissertation</dc:type>
 <dc:identifier>http://hdl.handle.net/10438/2676</dc:identifier>
 <dc:language>pt_BR</dc:language>
</oai_dc:dc>
#+end_example

** Current Workflow

- shell script 
 - python script getdata.py
 - XSLT transformation over dc metadata records
- show files
 
