jekyll/blog/_posts/2014-04-30-webinar.html

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Deduplication of instances</h2>
<div class="outline-text-2" id="text-5">
<p>
I briefly commented about the deduplication of records during the
webinar. I do have to take care of removing duplicated resources about
the same entity. Considering a thesis defended by and student at FGV
whom have as advisor a professor at FGV. I will have metadata
(triples) about this thesis from three different sources: (1) the RDF
produced from the advisor's curriculum lattes XML; (2) the RDF produce
from the student's curriculum lattes XML; and (3) the RDF obtained
from the FGV Digital Library. 
</p>

<p>
The <a href="http://github.com/arademaker/vivo-code">current code</a> that I use to identify duplicated resources is a
Common Lisp library that is easily used if placed inside the
local-projects directory of a <a href="http://www.quicklisp.org/">Quicklisp</a> instalation.
</p>

<p>
I can write an entire article only about deduplication in RDF. I am
still thinking hard about this problem and really would like to find
better alternatives.  One can note that deduplication of nodes in a
RDF graph should not be done type by type as I am doing now. The rules
to identify resources as being refering the same entity could
dependent each other. That is, the deduplication of instances of
<code>foaf:Person</code> can activate the rule to deduplicate instances of
<code>bibo:Article</code> and vice-versa. It would be better to have a kind of
fixed point transformation in the RDF graph that could keep clustering
nodes until nothing more can be done. As a logician, I am very
interested in approach this problem in a more declarative and
deductive way.
</p>

<p>
I also have to note that <code>owl:sameAs</code> semantics doesn't help here. I
do use <code>owl:sameAs</code> to mark the nodes that should be merged but I have
to merge the nodes after all <code>owl:sameAs</code> triples are produced. I do
this with two SPARQL construct queries:
</p>

<pre class="example">
delete { ?s1 ?p ?o . }
insert { ?s2 ?p ?o . }
where {
  ?s1 owl:sameAs ?s2 .
  ?s1 ?p ?o .
  filter( !sameTerm(?p, owl:sameAs) )
}
</pre>

<pre class="example">
delete { ?x ?p ?o1 . }
insert { ?x ?p ?o2 . }
where {
  ?o1 owl:sameAs ?o2 .
  ?x ?p ?o1 .
  filter( !sameTerm(?p, owl:sameAs) )
}
</pre>

<p>
Note that the filters block the propagation of the <code>owl:sameAs</code>
triples. Anyway, my current code is available for suggestions.
</p>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Mapping Lattes RDF to VIVO RDF</h2>
<div class="outline-text-2" id="text-6">
<p>
To map the Lattes RDF model produced by my XSLT to the expected VIVO
RDF model, I have to look carefully to each instance of data. This
mapping is not completed but at this point I have already mapped most
of the data about people, publication, research areas and
departaments.
</p>

<p>
To work on the rules and queries to transform the data, I used to
excellent query and data browsers tools developed by Franz: Gruff and
AllegroGraph WebView. During the webinar I presented both systems.
</p>

<ul class="org-ul">
<li>CWM and file rules.n3 (performance issues, used for prototype)
</li>
<li>CL + SPARQL (show saved queries in Allegro Graph WebView)
<ul class="org-ul">
<li>Problems:
<ul class="org-ul">
<li>blank nodes
</li>
<li>can't repeate a query without duplicate triples
</li>
</ul>
</li>
</ul>
</li>
<li>Next steps: 
<ul class="org-ul">
<li>validation (OWL Reasoner?)
</li>
<li>Better rule approach (like cwm) but with better performance?
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Working with OAI-PMH</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li><a href="http://www.openarchives.org">http://www.openarchives.org</a>
</li>
<li><a href="http://re.cs.uct.ac.za">http://re.cs.uct.ac.za</a>
</li>
<li><a href="http://cran.r-project.org/web/packages/OAIHarvester/index.html">http://cran.r-project.org/web/packages/OAIHarvester/index.html</a>
</li>
<li><a href="https://pypi.python.org/pypi/pyoai/2.4.4">https://pypi.python.org/pypi/pyoai/2.4.4</a>
</li>
</ul>
</div>

<div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> Repository Exploring</h3>
<div class="outline-text-3" id="text-7-1">
<div class="org-src-container">

<pre class="src src-R"><span style="color: #008b8b;">library</span>(OAIHarvester)
baseurl <span style="color: #008b8b;">&lt;-</span> <span style="color: #8b2252;">"http://bibliotecadigital.fgv.br/oai/request"</span>
oaih_list_metadata_formats(baseurl)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-R" id="sets">sets <span style="color: #008b8b;">&lt;-</span> oaih_list_sets(baseurl)
head(sets)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-R">records <span style="color: #008b8b;">&lt;-</span> oaih_list_records(baseurl, set = series[3,1])
dim(records)
colnames(records)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-R">records[1,<span style="color: #8b2252;">"metadata"</span>]
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> Current Workflow</h3>
<div class="outline-text-3" id="text-7-2">
<ul class="org-ul">
<li>shell script 
<ul class="org-ul">
<li>python script getdata.py
</li>
<li>XSLT transformation over dc metadata records
</li>
</ul>
</li>
<li>show files
</li>
</ul>
</div>
</div>
