jekyll/blog/_posts/2014-04-30-webinar.html

<div id="outline-container-sec-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="section-number-3">7.3</span> Future directions</h3>
<div class="outline-text-3" id="text-7-3">
<ul class="org-ul">
<li>CL package for OAI-PMH (forget Python!)
</li>
<li>retrieve using mets instead of dc
</li>
<li>see <a href="http://bibliotecadigital.fgv.br/dspace/handle/10438/11552?show=full">http://bibliotecadigital.fgv.br/dspace/handle/10438/11552?show=full</a>
</li>
</ul>

<div class="org-src-container">

<pre class="src src-R">r1 <span style="color: #008b8b;">&lt;-</span> oaih_list_records(baseurl, prefix = <span style="color: #8b2252;">"mets"</span>, set = series[3,1])
r1[1,<span style="color: #8b2252;">"metadata"</span>]
</pre>
</div>
</div>
</div>
</div>
